spec/fixtures/bulk/download_campaigns_by_account_ids/standard.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:ns0="https://bingads.microsoft.com/CampaignManagement/v13" xmlns:ns1="http://schemas.microsoft.com/2003/10/Serialization/Arrays" xmlns:ns2="https://adapi.microsoft.com" xmlns:ns3="http://schemas.datacontract.org/2004/07/System.Collections.Generic" xmlns:ns4="http://schemas.microsoft.com/2003/10/Serialization/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header>
    <ns0:AuthenticationToken>***FILTERED***</ns0:AuthenticationToken>
    <ns0:DeveloperToken>***FILTERED***</ns0:DeveloperToken>
    <ns0:CustomerId>***FILTERED***</ns0:CustomerId>
    <ns0:CustomerAccountId>***FILTERED***</ns0:CustomerAccountId>
  </soap:Header>
  <soap:Body>
    <ns0:DownloadCampaignsByAccountIdsRequest>
      <ns0:AccountIds>
        <ns1:long>150168726</ns1:long>
      </ns0:AccountIds>
      <ns0:CompressionType>Zip</ns0:CompressionType>
      <ns0:DataScope>EntityData</ns0:DataScope>
      <ns0:DownloadEntities>
        <ns0:DownloadEntity>Campaigns</ns0:DownloadEntity>
      </ns0:DownloadEntities>
      <ns0:DownloadFileType>Csv</ns0:DownloadFileType>
      <ns0:FormatVersion>6.0</ns0:FormatVersion>
    </ns0:DownloadCampaignsByAccountIdsRequest>
  </soap:Body>
</soap:Envelope>